.svn/pristine/3e/3e3366fd18dc9e188908e1df183aa16aabe5e6a0.svn-base

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:ProposalSaveNewAndMarketRenewal>
            <!--Optional:-->
            <tem:strInput>
                {
                "AdditionalBenefits": {
                "AutoExtensionofPolicy": "false",
                "BreakinReferenceNo": "0",
                "BreakinInspectionAgency":"",
                "BreakinPlace":"",
                "CodeApprovalNumber":"",
                "VehicleUsageParticulars":"",
                "CareExecutive": "___addon_road_assist_cover___",
                "CareStandard": "___addon_road_assist_cover___",
                "CholaValueAddedServicesCover": "false",
                "KeyReplacementOption": "",
                "CholamandalamMSAssistanceforRoadsideEmergencies": "___addon_road_assist_cover___",
                "Claimsinexpiringpolicy": "___is_claim_exists___",
                "ConsumableCoverage": "___addon_consumable_cover___",
                "ConsumablePlusCover": "false",
                "ConveyanceAllowanceCover": "___addon_inconvenience_allowance_cover___",
                "CoverageOfInsuranceCost": "false",
                "CoverageforRoadTaxandregistrationcharges": "false",
                "CoverforDrivingLicenseloss": "false",
                "CoverforPersonalluggageloss": "false",
                "CoverforVehicleIgnitionkey": "false",
                "DailyCashAllowance": "___addon_daily_allowance_cover___",
                "DisabledVehicleCoverage": "false",
                "OptionsForDisabledVehicleCoverage":"",
                "EMIProtectionCover": "false",
                "EMIValue": "0",
                "EngineSeizurePlusCover": "___addon_engine_protector_cover___",
                "ExpiringPolicyEndDate": "___policy_expiry_date___",
                "ExpiringPolicyStartDate": "___pre_policy_start_date___",
                "FiberTank": "false",
                "FullDeprWaiverCover": "false",
                "HydrostaticLockCover": "___addon_hydrostatic_lock_cover___",
                "KeyReplacementCover": "___addon_key_lock_cover___",
                "LoanProtection": "false",
                "MedicalExpensesCoverage": "___addon_medical_expense_cover___",
                "MonthlyInstallmentCover": "false",
                "NCBPercentage": "___vehicle_ncb_next___",
                "NewVehicleReplacement": "false",
                "NoClaimBonusProtection": "___addon_ncb_protection_cover___",
                "NoOfDays": "0",
                "NoofInstallments": "0",
                "NoofTrailers": "0",
                "TrailerType":"",
                "NumberOfTyres": "0",
                "OptionConveyaAllowanceCover": "0",
                "OptionForMonthlyInstallmentCover": "",
                "OptionsTimeExcessFranchise": "0",
                "OptionsforDailyCashAllowance": "A",
                "PenaltyCoverage": "false",
                "PercentageWaiverofReductioninDepreciation": "0%",
                "PermitLoss": "false",
                "PolicyNumber": "74474747474",
                "PolicyType": "___vehicle_insurance_subtype___",
                "PreExistingDamage": "No",
                "PrevInsurCompanyNameCode": "___dbmaster_previousinsurer_code___",
                "BreakinInspectionDate":"",
                "BreakinInspectionTime":"",
                "RegistrationCertificateLossCover": "false",
                "RegistrationCost": "0",
                "ReimbursementofCostofDuplicateKeys": "false",
                "ReinstatementValuebasis": "false",
                "ReturnToInvoice": "___addon_invoice_price_cover___",
                "RimSafeguardCover": "false",
                "RoadTaxPaid": "0",
                "TimeExcess": "0",
                "TimeExcessForDC": "0",
                "TimeExcessForMIC": "0",
                "TrailerChassisNumber": "0",
                "TrailerRegisNumber": "0",
                "TyreSafeguardCover": "false",
                "WaiverofReductioninDepreciation": "false",
                "WrongFueling": "false"
                },
                "CoverVehicleAccessories": {
                "AgeofNominee": "0",
                "FibreGlassFuelTank": "___addon_repair_glass_fiber_plastic___",
                "FranchiseAgreementDiscount": "false",
                "IDVofElectricalAccessories": "___electrical_accessory___",
                "IDVofNonElectricalAccessories": "___non_electrical_accessory___",
                "IMT46": "false",
                "Indemnitytohirer": "false",
                "IsPAforPaidDriver": "___is_pa_paid_driver___",
                "LLtoEmployees": "false",
                "LLtoPaidDriver": "___is_llpd___",
                "LPGCNGIDV": "___external_bifuel_value___",
                "NameofPersons": "",
                "NumberofEmployees": "0",
                "NumberofPaidDrivers": "0",
                "NumberofPerson": "0",
                "NumberofUnNamedPerson": "___dbmaster_insurer_vehicle_seatingcapacity___",
                "PACoverforUnNamedPerson": "___is_pa_unnamed_passenger___",
                "PersonalAcciCoverForOwnerDriver": "___pa_owner_driver_si___",
                "PersonalCoverforNamedDriver": "false",
                "SumInsuredforNamedPersons": "0",
                "SumInsuredforPAforPaidDriver": "___pa_paid_driver_si___",
                "SumInsuredforUnNamedPersons": "___pa_unnamed_passenger_si___",
                "TypeOfElectricalAccessories": "",
                "AccidentsToSoldiersSailorsAirmenCover":"false",
                "ComercialAndPrivateUsageLoadingOD":"false",
                "ComercialAndPrivateUsageLoadingTP":"false",
                "GuardianName":"",
                "GuardianRelationshipwithNominee":"",
                "IMT18":"false",
                "IMT47":"false",
                "IMT50":"false",
                "IMT51":"false",
                "LLtoFarePayingPassengers":"false",
                "LLtoNonFarePayingPassengers":"false",
                "NameOfPersonsforNamedPA":"",
                "NoOfLLtoFarePayingPassengers":"0",
                "NoOfLLtoNonFarePayingPassengers":"0",
                "NoOfNamedPersons":"0",
                "NomineeName":"",
                "NomineeRelationship":"",
                "NumberOfConductor":"0",
                "NumberofCleaner":"0",
                "PACoverForNamedPersons":"false",
                "PercentageShare":"",
                "SumInsuredforPACover":"0",
                "TheftAndConversionRisk":"false",
                "TypeOfNonElectricalAccessories":""
                },
                "CustomerData": {
                "AadharNumber": "___aadhar___",
                "Area": "___permanent_locality_code___",
                "DateOfBirth": "___birth_date___",
                "EmailID": "___email___",
                "FinancierCode": "0",
                "Gender": "___gender___",
                "InsuredAddress": "___communication_address_1___ ___communication_address_2___ ___communication_address_3___",
                "InsuredName": "___salutation___ ___first_name___ ___middle_name___ ___last_name___",
                "MobileNumber": "___mobile___",
                "PinCode": "___permanent_pincode___",
                "TypeOfCustomer": "___vehicle_registration_type___",
                "AgreementType":"",
                "AlternatemailID":"",
                "GSTNumber":"",
                "ISDNNumber":"",
                "PanNo":""
                },
                "Discounts": {
                "Bangladesh": "0",
                "Bhutan": "0",
                "DTD": "0",
                "ExtensionCountryName": "",
                "IMT23": "false",
                "Maldives": "0",
                "Nepal": "0",
                "Pakistan": "0",
                "Srilanka": "0",
                "VoluntaryExcess": "0"
                },
                "IntermediaryCode": "200264572663",
                "TieUp": "PolicyBoss",
                "TransactionType": "___vehicle_insurance_type_2___",
                "UniqueTransactionID": "MT0004799976132897",
                "ContractNumber":"1234569874561",
                "GenconPropNumber":"",
                "VehicleDetails": {
                "BodyPrice": "0",
                "ChassisNumber": "___chassis_number___",
                "ChassisPrice": "0",
                "DateOfRegistration": "___vehicle_registration_date___",
                "EngineNumber": "___engine_number___",
                "FuelType": "___dbmaster_insurer_vehicle_fueltype___",
                "IDV": "43714",
                "IsHandicapped": "false",
                "NoDrivingLicense": "",
                "NoofyearsforPAownerdriver": "___vehicle_insurance_subtype_3___",
                "PolicyEndDate": "___policy_end_date___",
                "PolicyStartDate": "___policy_start_date___",
                "PolicyEndTime":"",
                "PolicyStartTime":"",
                "RTOLocationCode": "12793",
                "RegistrationNumber": "___registration_no_1___-___registration_no_2___-___registration_no_3___-___registration_no_4___",
                "TPPDLimit": "0",
                "TenureOption": "___vehicle_insurance_subtype_2___",
                "VehicleModelCode": "___dbmaster_insurer_vehicle_model_code___",
                "YearofManufacturer": "___vehicle_manf_year___",
                "TieUpFlag":"CIFCO",
                "VehicleCategory":"",
                "VehicleSubClassCode":""
                },
                "VehicleType": "___product_id_2___"
                }
            </tem:strInput>
        </tem:ProposalSaveNewAndMarketRenewal>
    </soapenv:Body>
</soapenv:Envelope>